dottwin/testing/TestExampleTwinSubsystemSameGraph.dot
digraph  {
	subgraph cluster_s2 {
		subgraph cluster_s9 {
			label="subsystem2";
			n11[label="in3",shape="point"];
			n12[label="out3",shape="point"];
			n13[label="subcomponent 3"];
			n11:s->n13:n[taillabel="in3"];
			
		}
		label="subsystem";
		n4[label="in1",shape="point"];
		n5[label="in2",shape="point"];
		n6[label="out2",shape="point"];
		n7[label="subcomponent 1"];
		n8[label="subcomponent 2"];
		n10[href="subsystem2.svg",label="subsystem2",shape="box3d"];
		n4:s->n7:n[taillabel="in1"];
		n7->n8;
		n7->n10[label="in3"];
		n8:s->n6:n[headlabel="out2"];
		n10->n8[label="out3"];
		
	}
	
	n1[label="component"];
	n3[href="subsystem.svg",label="subsystem",shape="box3d"];
	n1->n3[label="in1"];
	n1->n3[label="in2"];
	n3->n1[label="out2"];
	
}
